; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	infrared1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation1 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 154)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 166)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star3)
	(supports instrument8 infrared1)
	(supports instrument8 spectrograph2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 126)
	(supports instrument9 spectrograph2)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 180)
	(= (data Star4 infrared1) 202)
	(= (data Planet5 infrared1) 214)
	(= (data Star6 infrared1) 84)
	(= (data Planet7 infrared1) 203)
	(= (data Planet8 infrared1) 127)
	(= (data Star4 spectrograph0) 87)
	(= (data Planet5 spectrograph0) 12)
	(= (data Star6 spectrograph0) 158)
	(= (data Planet7 spectrograph0) 65)
	(= (data Planet8 spectrograph0) 146)
	(= (data Star4 spectrograph2) 225)
	(= (data Planet5 spectrograph2) 108)
	(= (data Star6 spectrograph2) 255)
	(= (data Planet7 spectrograph2) 6)
	(= (data Planet8 spectrograph2) 24)
	(= (slew_time GroundStation2 GroundStation0) 34.21)
	(= (slew_time GroundStation0 GroundStation2) 34.21)
	(= (slew_time GroundStation2 GroundStation1) 23.84)
	(= (slew_time GroundStation1 GroundStation2) 23.84)
	(= (slew_time Star3 GroundStation0) 47.85)
	(= (slew_time GroundStation0 Star3) 47.85)
	(= (slew_time Star3 GroundStation1) 1.947)
	(= (slew_time GroundStation1 Star3) 1.947)
	(= (slew_time Star3 GroundStation2) 29.41)
	(= (slew_time GroundStation2 Star3) 29.41)
	(= (slew_time GroundStation1 GroundStation0) 56.64)
	(= (slew_time GroundStation0 GroundStation1) 56.64)
	(= (slew_time Star4 GroundStation0) 13.97)
	(= (slew_time GroundStation0 Star4) 13.97)
	(= (slew_time Star4 GroundStation1) 10.53)
	(= (slew_time GroundStation1 Star4) 10.53)
	(= (slew_time Star4 GroundStation2) 41.75)
	(= (slew_time GroundStation2 Star4) 41.75)
	(= (slew_time Star4 Star3) 1.401)
	(= (slew_time Star3 Star4) 1.401)
	(= (slew_time Planet5 GroundStation0) 5.904)
	(= (slew_time GroundStation0 Planet5) 5.904)
	(= (slew_time Planet5 GroundStation1) 1.127)
	(= (slew_time GroundStation1 Planet5) 1.127)
	(= (slew_time Planet5 GroundStation2) 30.25)
	(= (slew_time GroundStation2 Planet5) 30.25)
	(= (slew_time Planet5 Star3) 33.74)
	(= (slew_time Star3 Planet5) 33.74)
	(= (slew_time Planet5 Star4) 17.43)
	(= (slew_time Star4 Planet5) 17.43)
	(= (slew_time Star6 GroundStation0) 21.97)
	(= (slew_time GroundStation0 Star6) 21.97)
	(= (slew_time Star6 GroundStation1) 27.82)
	(= (slew_time GroundStation1 Star6) 27.82)
	(= (slew_time Star6 GroundStation2) 2.637)
	(= (slew_time GroundStation2 Star6) 2.637)
	(= (slew_time Star6 Star3) 3.683)
	(= (slew_time Star3 Star6) 3.683)
	(= (slew_time Star6 Star4) 22.85)
	(= (slew_time Star4 Star6) 22.85)
	(= (slew_time Star6 Planet5) 56.07)
	(= (slew_time Planet5 Star6) 56.07)
	(= (slew_time Planet7 GroundStation0) 34.97)
	(= (slew_time GroundStation0 Planet7) 34.97)
	(= (slew_time Planet7 GroundStation1) 7.062)
	(= (slew_time GroundStation1 Planet7) 7.062)
	(= (slew_time Planet7 GroundStation2) 37.45)
	(= (slew_time GroundStation2 Planet7) 37.45)
	(= (slew_time Planet7 Star3) 32.12)
	(= (slew_time Star3 Planet7) 32.12)
	(= (slew_time Planet7 Star4) 14.01)
	(= (slew_time Star4 Planet7) 14.01)
	(= (slew_time Planet7 Planet5) 14.31)
	(= (slew_time Planet5 Planet7) 14.31)
	(= (slew_time Planet7 Star6) 86.59)
	(= (slew_time Star6 Planet7) 86.59)
	(= (slew_time Planet8 GroundStation0) 4.004)
	(= (slew_time GroundStation0 Planet8) 4.004)
	(= (slew_time Planet8 GroundStation1) 55.21)
	(= (slew_time GroundStation1 Planet8) 55.21)
	(= (slew_time Planet8 GroundStation2) 35.4)
	(= (slew_time GroundStation2 Planet8) 35.4)
	(= (slew_time Planet8 Star3) 23.93)
	(= (slew_time Star3 Planet8) 23.93)
	(= (slew_time Planet8 Star4) 31.17)
	(= (slew_time Star4 Planet8) 31.17)
	(= (slew_time Planet8 Planet5) 25.06)
	(= (slew_time Planet5 Planet8) 25.06)
	(= (slew_time Planet8 Star6) 21.53)
	(= (slew_time Star6 Planet8) 21.53)
	(= (slew_time Planet8 Planet7) 70.39)
	(= (slew_time Planet7 Planet8) 70.39)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(pointing satellite2 Star4)
	(pointing satellite3 Planet7)
	(have_image Star4 spectrograph0)
	(have_image Planet5 spectrograph0)
	(have_image Star6 infrared1)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 spectrograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 planet7 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet7)
   changed: (fuel satellite3) from 180 to 142.55, (fuel-used) from 0 to 37.45
   goals met: 1 of 8
2. (turn_to satellite0 groundstation2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 154 to 123.75, (fuel-used) from 37.45 to 67.7
   goals met: 1 of 8
3. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 1 of 8
4. (calibrate satellite2 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 1 of 8
5. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 166 to 163.363, (fuel-used) from 67.7 to 70.337
   goals met: 2 of 8
6. (switch_off instrument8 satellite2)
   deleted: (power_on instrument8)
   added: (power_avail satellite2)
   goals met: 2 of 8
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 8
8. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 8
9. (turn_to satellite2 planet5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 126 to 124.873, (fuel-used) from 70.337 to 71.464
   goals met: 2 of 8
10. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 2 of 8
11. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 163.363 to 160.726, (fuel-used) from 71.464 to 74.101
   goals met: 1 of 8
12. (take_image satellite1 star6 instrument3 infrared1)
   added: (have_image star6 infrared1)
   changed: (data_capacity satellite1) from 1000 to 916, (data-stored) from 0 to 84
   goals met: 2 of 8
13. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 160.726 to 158.089, (fuel-used) from 74.101 to 76.738
   goals met: 3 of 8
14. (turn_to satellite2 star4 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 124.873 to 107.443, (fuel-used) from 76.738 to 94.168
   goals met: 4 of 8
15. (turn_to satellite3 groundstation1 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 142.55 to 135.488, (fuel-used) from 94.168 to 101.23
   goals met: 3 of 8
16. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 3 of 8
17. (calibrate satellite3 instrument9 groundstation1)
   added: (calibrated instrument9)
   goals met: 3 of 8
18. (turn_to satellite3 planet7 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet7)
   changed: (fuel satellite3) from 135.488 to 128.426, (fuel-used) from 101.23 to 108.292
   goals met: 4 of 8
19. (turn_to satellite2 planet5 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 107.443 to 90.013, (fuel-used) from 108.292 to 125.722
   goals met: 3 of 8
20. (turn_to satellite2 groundstation1 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 90.013 to 88.886, (fuel-used) from 125.722 to 126.849
   goals met: 3 of 8
21. (turn_to satellite2 star3 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 88.886 to 86.939, (fuel-used) from 126.849 to 128.796
   goals met: 3 of 8
22. (turn_to satellite2 groundstation1 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 86.939 to 84.992, (fuel-used) from 128.796 to 130.743
   goals met: 3 of 8
23. (turn_to satellite2 planet5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 84.992 to 83.865, (fuel-used) from 130.743 to 131.87
   goals met: 3 of 8
24. (take_image satellite3 planet7 instrument9 spectrograph0)
   added: (have_image planet7 spectrograph0)
   changed: (data_capacity satellite3) from 1000 to 935, (data-stored) from 84 to 149
   goals met: 4 of 8
25. (turn_to satellite2 groundstation1 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 83.865 to 82.738, (fuel-used) from 131.87 to 132.997
   goals met: 4 of 8
26. (turn_to satellite2 planet5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 82.738 to 81.611, (fuel-used) from 132.997 to 134.124
   goals met: 4 of 8
27. (turn_to satellite2 groundstation1 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 81.611 to 80.484, (fuel-used) from 134.124 to 135.251
   goals met: 4 of 8
28. (turn_to satellite2 planet5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 80.484 to 79.357, (fuel-used) from 135.251 to 136.378
   goals met: 4 of 8
29. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 4 of 8
30. (switch_on instrument8 satellite2)
   deleted: (calibrated instrument8) (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 4 of 8
31. (switch_off instrument8 satellite2)
   deleted: (power_on instrument8)
   added: (power_avail satellite2)
   goals met: 4 of 8
32. (turn_to satellite2 groundstation1 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 79.357 to 78.23, (fuel-used) from 136.378 to 137.505
   goals met: 4 of 8
33. (turn_to satellite2 planet5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 78.23 to 77.103, (fuel-used) from 137.505 to 138.632
   goals met: 4 of 8
34. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 4 of 8
35. (turn_to satellite2 groundstation1 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 77.103 to 75.976, (fuel-used) from 138.632 to 139.759
   goals met: 4 of 8
36. (calibrate satellite2 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 4 of 8
37. (turn_to satellite2 planet5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 75.976 to 74.849, (fuel-used) from 139.759 to 140.886
   goals met: 4 of 8
38. (take_image satellite2 planet5 instrument8 spectrograph0)
   added: (have_image planet5 spectrograph0)
   changed: (data_capacity satellite2) from 1000 to 988, (data-stored) from 149 to 161
   goals met: 5 of 8
39. (turn_to satellite2 star4 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 74.849 to 57.419, (fuel-used) from 140.886 to 158.316
   goals met: 6 of 8
40. (take_image satellite2 star4 instrument8 spectrograph0)
   added: (have_image star4 spectrograph0)
   changed: (data_capacity satellite2) from 988 to 901, (data-stored) from 161 to 248
   goals met: 7 of 8
41. (turn_to satellite2 planet8 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 57.419 to 26.249, (fuel-used) from 158.316 to 189.486
   goals met: 6 of 8
42. (take_image satellite2 planet8 instrument8 spectrograph2)
   added: (have_image planet8 spectrograph2)
   changed: (data_capacity satellite2) from 901 to 877, (data-stored) from 248 to 272
   goals met: 7 of 8
43. (turn_to satellite2 star3 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 26.249 to 2.319, (fuel-used) from 189.486 to 213.416
   goals met: 7 of 8
44. (turn_to satellite2 star4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 2.319 to 0.918, (fuel-used) from 213.416 to 214.817
   goals met: 8 of 8
